Autodesk.Revit.DB.BuiltInFailures.RefPlaneFailures.AlreadyHaveTwoClosurePlanes
No more than two closure planes are allowed.

Autodesk.Revit.DB.BuiltInFailures.RefPlaneFailures
Failures about RefPlane.